src/Scripts/Newbe.NormalAspnetCore.Dapr/test.result.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: test.js
     output: -

  scenarios: (100.00%) 1 scenario, 100 max VUs, 1m10s max duration (incl. graceful stop):
           * default: Up to 100 looping VUs for 40s over 2 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.7s), 007/100 VUs, 341 complete and 0 interrupted iterations
default   [   2% ] 007/100 VUs  00.7s/40.0s

running (0m01.7s), 017/100 VUs, 1527 complete and 0 interrupted iterations
default   [   4% ] 017/100 VUs  01.7s/40.0s

running (0m02.7s), 027/100 VUs, 3003 complete and 0 interrupted iterations
default   [   7% ] 027/100 VUs  02.7s/40.0s

running (0m03.7s), 037/100 VUs, 4481 complete and 0 interrupted iterations
default   [   9% ] 037/100 VUs  03.7s/40.0s

running (0m04.7s), 047/100 VUs, 6184 complete and 0 interrupted iterations
default   [  12% ] 047/100 VUs  04.7s/40.0s

running (0m05.7s), 056/100 VUs, 7976 complete and 0 interrupted iterations
default   [  14% ] 056/100 VUs  05.7s/40.0s

running (0m06.7s), 066/100 VUs, 9694 complete and 0 interrupted iterations
default   [  17% ] 066/100 VUs  06.7s/40.0s

running (0m07.7s), 076/100 VUs, 11528 complete and 0 interrupted iterations
default   [  19% ] 076/100 VUs  07.7s/40.0s

running (0m08.7s), 086/100 VUs, 13221 complete and 0 interrupted iterations
default   [  22% ] 086/100 VUs  08.7s/40.0s

running (0m09.7s), 096/100 VUs, 14615 complete and 0 interrupted iterations
default   [  24% ] 096/100 VUs  09.7s/40.0s

running (0m10.7s), 100/100 VUs, 15484 complete and 0 interrupted iterations
default   [  27% ] 100/100 VUs  10.7s/40.0s

running (0m11.7s), 100/100 VUs, 16436 complete and 0 interrupted iterations
default   [  29% ] 100/100 VUs  11.7s/40.0s

running (0m12.7s), 100/100 VUs, 16436 complete and 0 interrupted iterations
default   [  32% ] 100/100 VUs  12.7s/40.0s

running (0m13.7s), 100/100 VUs, 16436 complete and 0 interrupted iterations
default   [  34% ] 100/100 VUs  13.7s/40.0s

running (0m14.7s), 100/100 VUs, 16488 complete and 0 interrupted iterations
default   [  37% ] 100/100 VUs  14.7s/40.0s

running (0m15.7s), 100/100 VUs, 16536 complete and 0 interrupted iterations
default   [  39% ] 100/100 VUs  15.7s/40.0s

running (0m16.7s), 100/100 VUs, 16755 complete and 0 interrupted iterations
default   [  42% ] 100/100 VUs  16.7s/40.0s

running (0m17.7s), 100/100 VUs, 17882 complete and 0 interrupted iterations
default   [  44% ] 100/100 VUs  17.7s/40.0s

running (0m18.7s), 100/100 VUs, 19404 complete and 0 interrupted iterations
default   [  47% ] 100/100 VUs  18.7s/40.0s

running (0m19.7s), 100/100 VUs, 19951 complete and 0 interrupted iterations
default   [  49% ] 100/100 VUs  19.7s/40.0s

running (0m20.7s), 100/100 VUs, 21265 complete and 0 interrupted iterations
default   [  52% ] 100/100 VUs  20.7s/40.0s

running (0m21.7s), 100/100 VUs, 22187 complete and 0 interrupted iterations
default   [  54% ] 100/100 VUs  21.7s/40.0s

running (0m22.7s), 100/100 VUs, 22718 complete and 0 interrupted iterations
default   [  57% ] 100/100 VUs  22.7s/40.0s

running (0m23.7s), 100/100 VUs, 22718 complete and 0 interrupted iterations
default   [  59% ] 100/100 VUs  23.7s/40.0s

running (0m24.7s), 100/100 VUs, 22857 complete and 0 interrupted iterations
default   [  62% ] 100/100 VUs  24.7s/40.0s

running (0m25.7s), 100/100 VUs, 24561 complete and 0 interrupted iterations
default   [  64% ] 100/100 VUs  25.7s/40.0s

running (0m26.7s), 100/100 VUs, 26047 complete and 0 interrupted iterations
default   [  67% ] 100/100 VUs  26.7s/40.0s

running (0m27.7s), 100/100 VUs, 27447 complete and 0 interrupted iterations
default   [  69% ] 100/100 VUs  27.7s/40.0s

running (0m28.7s), 100/100 VUs, 27830 complete and 0 interrupted iterations
default   [  72% ] 100/100 VUs  28.7s/40.0s

running (0m29.7s), 100/100 VUs, 27930 complete and 0 interrupted iterations
default   [  74% ] 100/100 VUs  29.7s/40.0s

running (0m30.7s), 100/100 VUs, 27930 complete and 0 interrupted iterations
default   [  77% ] 100/100 VUs  30.7s/40.0s

running (0m31.7s), 100/100 VUs, 28030 complete and 0 interrupted iterations
default   [  79% ] 100/100 VUs  31.7s/40.0s

running (0m32.7s), 100/100 VUs, 29172 complete and 0 interrupted iterations
default   [  82% ] 100/100 VUs  32.7s/40.0s

running (0m33.7s), 100/100 VUs, 29313 complete and 0 interrupted iterations
default   [  84% ] 100/100 VUs  33.7s/40.0s

running (0m34.7s), 100/100 VUs, 30205 complete and 0 interrupted iterations
default   [  87% ] 100/100 VUs  34.7s/40.0s

running (0m35.7s), 100/100 VUs, 31709 complete and 0 interrupted iterations
default   [  89% ] 100/100 VUs  35.7s/40.0s

running (0m36.7s), 100/100 VUs, 32608 complete and 0 interrupted iterations
default   [  92% ] 100/100 VUs  36.7s/40.0s

running (0m37.7s), 100/100 VUs, 32755 complete and 0 interrupted iterations
default   [  94% ] 100/100 VUs  37.7s/40.0s

running (0m38.7s), 100/100 VUs, 34351 complete and 0 interrupted iterations
default   [  97% ] 100/100 VUs  38.7s/40.0s

running (0m39.7s), 100/100 VUs, 35531 complete and 0 interrupted iterations
default   [  99% ] 100/100 VUs  39.7s/40.0s

running (0m40.1s), 000/100 VUs, 36156 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  40s

    data_received..............: 26 MB  645 kB/s
    data_sent..................: 5.7 MB 142 kB/s
    http_req_blocked...........: avg=7.64µs   min=0s     med=0s      max=8.99ms  p(90)=0s       p(95)=0s      
    http_req_connecting........: avg=3.79µs   min=0s     med=0s      max=8.99ms  p(90)=0s       p(95)=0s      
    http_req_duration..........: avg=96.77ms  min=1.99ms med=49.05ms max=3.37s   p(90)=131ms    p(95)=247.84ms
    http_req_receiving.........: avg=133.58µs min=0s     med=0s      max=65.97ms p(90)=304.2µs  p(95)=1ms     
    http_req_sending...........: avg=15.72µs  min=0s     med=0s      max=2ms     p(90)=0s       p(95)=0s      
    http_req_tls_handshaking...: avg=0s       min=0s     med=0s      max=0s      p(90)=0s       p(95)=0s      
    http_req_waiting...........: avg=96.62ms  min=1.99ms med=49ms    max=3.37s   p(90)=130.54ms p(95)=247.84ms
    http_reqs..................: 36156  902.677274/s
    iteration_duration.........: avg=96.85ms  min=1.99ms med=49.51ms max=3.37s   p(90)=131.02ms p(95)=247.84ms
    iterations.................: 36156  902.677274/s
    vus........................: 100    min=10  max=100
    vus_max....................: 100    min=100 max=100